УТ/src/ExchangePlans/CRM_СинхронизацияСМобильнымПриложениемНовый/CRM_СинхронизацияСМобильнымПриложениемНовый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="df0549ff-2ca6-4f11-ab58-449d09e1906e">
  <name>CRM_СинхронизацияСМобильнымПриложениемНовый</name>
  <comment>Не переносить после первой загрузки в объединенные решения</comment>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьДоступНаУровнеЗаписей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьГруппыДоступаПартнеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеПользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеГруппыДоступаПартнеров</name>
    <attributes>
      <name>ГруппаДоступа</name>
      <type>
        <types>CatalogRef.ГруппыДоступаПартнеров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

УТ/src/ExchangePlans/CRM_СинхронизацияСМобильнымПриложениемНовый/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// BSLLS:DataExchangeLoading-off
Процедура ПередЗаписью(Отказ)
	
	// Проверка значения свойства ОбменДанными.Загрузка отсутствует по причине того, что в расположенным ниже коде,
	// реализована логика, которая должна выполняться в том числе при установке этого свойства равным Истина
	// (на стороне кода, который выполняет попытку записи в данный план обмена).
	
	Если РаботаВМоделиСервиса.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Константы.CRM_ИспользуетсяОбменСiCRM.Получить() Или ЭтотУзел Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ОграничиватьДоступНаУровнеЗаписей = Константы["ОграничиватьДоступНаУровнеЗаписей"].Получить();
		ИспользоватьГруппыДоступаПартнеров = Константы["ИспользоватьГруппыДоступаПартнеров"].Получить();
	КонецЕсли;
	
	МассивДоступныеПользователи = CRM_СинхронизацияСiCRMНовый.ПолучитьСписокДоступныхПользователейДляОбмена(Пользователь);
	ДоступныеПользователи.Очистить();
	Для Каждого ДоступныйПользователь Из МассивДоступныеПользователи Цикл
		Если НЕ ДоступныйПользователь.ПометкаУдаления Тогда
			Стр = ДоступныеПользователи.Добавить();
			Стр.Пользователь = ДоступныйПользователь;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		МассивДоступныеГруппыДоступаПартнеров =
			CRM_СинхронизацияСiCRMНовый.ПолучитьСписокДоступныхГруппДоступаПартнеров(Пользователь);
		ДоступныеГруппыДоступаПартнеров.Очистить();
		Для Каждого ДоступнаяГруппыДоступаПартнеров Из МассивДоступныеГруппыДоступаПартнеров Цикл
			Если НЕ ДоступнаяГруппыДоступаПартнеров.ПометкаУдаления Тогда
				Стр = ДоступныеГруппыДоступаПартнеров.Добавить();
				Стр.ГруппаДоступа = ДоступнаяГруппыДоступаПартнеров;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
// BSLLS:DataExchangeLoading-on

// BSLLS:DataExchangeLoading-off
Процедура ПриЗаписи(Отказ)
	
	// Проверка значения свойства ОбменДанными.Загрузка отсутствует по причине того, что в расположенным ниже коде,
	// реализована логика, которая должна выполняться в том числе при установке этого свойства равным Истина
	// (на стороне кода, который выполняет попытку записи в данный план обмена).
	
	Если РаботаВМоделиСервиса.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("ИмяПланаОбмена",  "CRM_СинхронизацияСМобильнымПриложениемНовый");
	СтруктураЗаписи.Вставить("ВидПравил",       Перечисления.ВидыПравилДляОбменаДанными.ПравилаРегистрацииОбъектов);
	СтруктураЗаписи.Вставить("ИмяМакетаПравил", "ПравилаРегистрации");
	СтруктураЗаписи.Вставить("ИсточникПравил",  Перечисления.ИсточникиПравилДляОбменаДанными.МакетКонфигурации);
	СтруктураЗаписи.Вставить("ИспользоватьФильтрВыборочнойРегистрацииОбъектов", Истина);
	
	// Получаем набор записей регистра.
	
	НаборЗаписей = СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, "ПравилаДляОбменаДанными");
	
	// Добавляем только одну запись в новый набор записей.
	НоваяЗапись = НаборЗаписей.Добавить();
	
	// Заполняем значения свойств записи из структуры.
	ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
	
	// Загружаем правила для обмена данными в ИБ.
	РегистрыСведений.ПравилаДляОбменаДанными.ЗагрузитьПравила(Отказ, НаборЗаписей[0]);
	
	Если Не Отказ Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры
// BSLLS:DataExchangeLoading-on

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра)
	
	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];
	
	// Создаем набор записей регистра.
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	
	// Устанавливаем отбор по измерениям регистра.
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		// Если задано значение в структуре, то отбор устанавливаем.
		Если СтруктураЗаписи.Свойство(Измерение.Имя) Тогда
			
			НаборЗаписей.Отбор[Измерение.Имя].Установить(СтруктураЗаписи[Измерение.Имя]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НаборЗаписей;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли
